class PopularBookModel {
  String title, author, price, image, description;
  int color;

  PopularBookModel(this.title, this.author, this.price, this.image, this.color,
      this.description);
}

List<PopularBookModel> populars = popularBookData
    .map((item) => PopularBookModel(item['title'], item['author'],
        item['price'], item['image'], item['color'], item['description']))
    .toList();

var popularBookData = [
  {
    "title": "Mushoku Tensei 7",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b7.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 8",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b8.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 9",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b9.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 10",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b10.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 11",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b12.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 13",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b13.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 14",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b14.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 15",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b15.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 16",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b16.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 17",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b17.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 18",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b18.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 19",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b19.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
  {
    "title": "Mushoku Tensei 20",
    "author": "Rifujin na Magonote",
    "price": "259",
    "image": "assets/images/b20.png",
    "color": 0xFF2B325C,
    "description":
        "รูเดียสบรรลุเป้าหมายที่เข้ามหาวิทยาลัยเวทมนตร์แล้ว เมื่อได้ความมั่นใจในฐานะลูกผู้ชายกลับคืนมา เขาก็มุ่งหน้าไปยังห้องสภานักเรียนเพื่อขอบคุณและรายงานต่อพวกอาเรียลที่ช่วยดูแล อาเรียลถามว่าหลังจากนี้คิดจะทำอย่างไรกับซิลฟีเอ็ต คำถามนั่นทำให้รูเดียสสับสนแต่ก็ตอบกลับไปอย่างชัดเจนว่าผมจะแต่งงานกับซิลฟีครับหาที่อยู่ใหม่ เตรียมงานฉลองและจัดหาสิ่งของที่จำเป็นในการแต่งงานอย่างเร่งด่วน มีแต่งานที่ต้องทำทั้งนั้น ชีวิตแต่งงานที่ไม่เคยสมหวังในชาติก่อนเกิดเรื่องวุ่นวายอย่างคาดไม่ถึง!?เรื่องราวของชายหนุ่มวัย 34 ผู้ไม่เอาไหนซึ่งกลับชาติมาเกิดใหม่ในโลกแห่งเวทมนตร์และคมดาบ ดำเนินมาถึงเล่มที่ 10 แล้ว!"
  },
];
